cases/swril_ico/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    air_inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }
    bottom_wall
    {
        type            noSlip;
    }
    air_outer_wall
    {
        type            noSlip;
    }
    air_inner_wall
    {
        type            noSlip;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.05);
    }
    outer_wall
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    foil_wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
